# BuildingEnvelopeAnalyzerOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuildingEnvelopeAnalyzerOptions Constructor
BuildingEnvelopeAnalyzerOptions Class See Also
---
Constructs a new instance of BuildingEnvelopeAnalyzerOptions, using default values.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public BuildingEnvelopeAnalyzerOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
BuildingEnvelopeAnalyzerOptions()
```

# See Also
BuildingEnvelopeAnalyzerOptions Class
Autodesk.Revit.DB.Analysis Namespace